from typing import Any

import pandas as pd
import pytest


@pytest.fixture
def sample_transactions_df() -> Any:
    """Фикстура с тестовыми транзакциями"""
    return pd.DataFrame(
        {
            "Номер карты": ["1234567812345678", "8765432187654321", "1234567812345678"],
            "Дата операции": ["01.01.2024 10:00:00", "05.01.2024 15:00:00", "10.01.2024 12:00:00"],
            "Сумма операции": [-1000, -500, -200],
            "Категория": ["Супермаркеты", "Транспорт", "Супермаркеты"],
            "Описание": ["Магнит", "Такси", "Пятерочка"],
        }
    )


@pytest.fixture
def sample_transactions_list() -> Any:
    """Фикстура с тестовыми транзакциями в виде списка словарей"""
    return [
        {
            "Дата операции": "01.01.2024 10:00:00",
            "Описание": "Магнит",
            "Сумма операции": -1000,
            "Категория": "Супермаркеты",
        },
        {
            "Дата операции": "05.01.2024 15:00:00",
            "Описание": "Такси",
            "Сумма операции": -500,
            "Категория": "Транспорт",
        },
    ]


@pytest.fixture
def sample_date() -> Any:
    """Фикстура с тестовой датой"""
    return "2024-01-15 12:00:00"


@pytest.fixture
def sample_category() -> Any:
    """Фикстура с тестовой категорией"""
    return "Супермаркеты"
